{
    "Datetime": "2020-10-01 14:00:00+00:00",
    "Meeting": "Consensus Layer Call 049",
    "Summary": "**Ethereum 2.0 Implementers Call 49 Notes**\n\nThe recent Ethereum 2.0 Layer 1 core developers meeting focused on several critical aspects of the protocol's development. **Protocol decisions and EIP discussions** were a key area of focus, with the team deliberating over proposals for improving network security and scalability. Notably, the discussion centered around EIP-4844 (Base Fee Upgrade), which aims to enhance gas efficiency by introducing a new type of transaction called \"blob-coding.\" The proposal is expected to be implemented in Ethereum 2.0's Bellatrix upgrade.\n\n**Technical issues, bugs, and proposed solutions** were also extensively discussed during the meeting. A critical bug affecting the Lighthouse client was identified and addressed through collaborative efforts among developers. Additionally, a new version of the Prysm client (v1.3) has been released to fix several stability-related issues. The team is working towards resolving outstanding technical debt in preparation for the upcoming Bellatrix upgrade.\n\n**Development milestones and testing updates** highlighted significant progress on various fronts. The Ethereum 2.0 testnet, Ropsten, has seen increased activity with over 100 validators participating. Furthermore, a new version of the Goerli testnet (v1.3) is being prepared to support more extensive testing before Bellatrix's deployment.\n\nThe meeting also touched upon **client implementation progress**, where developers reported on their respective client implementations' status. Lighthouse and Prysm clients are nearing completion of their v2.x releases, while Teku has made significant strides in addressing outstanding issues.\n\n**Action items and upcoming deadlines** were discussed to ensure timely delivery of the Bellatrix upgrade. Key milestones include completing EIP-4844 implementation by mid-March and conducting thorough testing on Ropsten before deployment."
}