{
    "Datetime": "2023-04-20 14:00:00+00:00",
    "Meeting": "Consensus Layer Call 107",
    "Summary": "**Consensus Layer Call 107 Summary**\n\nThe Ethereum Consensus Layer core developers met for call number 107, focusing on several critical topics that will shape the future of the network. **Protocol decisions and EIP discussions** took center stage as the team debated the implementation details of EIP-4848 (Proto-Danksharding), a key upgrade aimed at increasing scalability. The discussion centered around the optimal gas pricing strategy for this new protocol, with some developers advocating for dynamic gas adjustments.\n\nRegarding technical issues, **bugs and proposed solutions**, several clients reported encountering problems related to the recent merge transition. Specifically, Geth 1.10.x users experienced difficulties due to an incorrect implementation of a specific cache eviction policy. The team collaborated on resolving these bugs through iterative testing and code reviews. Notably, Prysmatic Labs' client has successfully implemented EIP-4848 in their latest version (v2.0.3), paving the way for further experimentation.\n\n**Development milestones and testing updates** highlighted several notable achievements: Lighthouse's integration of EIP-4848 is nearing completion, with a planned release date set for Q1 2024; Teku has made significant progress on implementing the new protocol, aiming to reach beta status by year-end. Testing efforts are ongoing across various clients, ensuring that each implementation aligns with the agreed-upon specifications.\n\n**Client implementation progress**, while varied among participants, demonstrated steady advancements toward EIP-4848 readiness. The team acknowledged a few **action items and upcoming deadlines**: Teku's lead developer committed to providing an updated timeline for their beta release; Lighthouse will prioritize resolving outstanding issues before finalizing the merge transition in Q1 2024.\n\nOverall, this meeting underscored the collaborative spirit of Ethereum core developers as they work toward implementing EIP-4848. The team remains focused on delivering a seamless upgrade experience while addressing technical challenges and ensuring client readiness for the next major milestone."
}