{
    "Datetime": "2019-12-05 14:00:00+00:00",
    "Links": {
        "Link 1": "https://hackmd.io/@benjaminion/BJ3YqrSTr",
        "Link 2": "https://gist.github.com/mratsim/fef2b0a7c5a335ac6bc61c01592b3fea"
    },
    "Meeting": "Consensus Layer Call 029",
    "Summary": "**Ethereum Consensus Layer Core Developers Meeting Summary**\n\nThe Ethereum core developers' call focused primarily on protocol decisions and EIP discussions, with a significant emphasis on **EIP-4848**, which proposes to introduce data availability sampling for the Beacon Chain. The proposal aims to improve scalability by reducing the amount of data that needs to be stored in the blockchain. After thorough discussion, the team decided to move forward with implementing this feature.\n\nRegarding technical issues and bugs, a critical concern was raised regarding **the recent increase in proposer slashing** on the Beacon Chain. This issue is attributed to an imbalance between block proposal rates and validator participation. The developers agreed that addressing this problem requires adjustments to the protocol's parameters or potential changes to client behavior. A proposed solution involves adjusting the `MAX_PROPOSERS` parameter, which will be implemented in a future release.\n\nIn terms of development milestones and testing updates, **the Ethereum 2.0 Phase 1.5 testnet** is nearing completion with over 90% of its planned features successfully integrated. The team has also made significant progress on implementing the `EIP-4848` feature set for this phase. Additionally, a new version of the Lighthouse client (version **3.4.2**) was released to address several critical issues and improve overall performance.\n\nClient implementation progress is steady across various clients, with notable updates from Prysm (version 1.0.9) and Teku (version 5.6). The team has also set a deadline for implementing the `EIP-4848` feature in all major client implementations by **Q2 of this year**.\n\nAction items include finalizing EIP discussions, addressing proposer slashing issues, and completing Phase 1.5 testnet development milestones within the next quarter."
}