{
    "Datetime": "2019-09-19 14:00:00+00:00",
    "Meeting": "Consensus Layer Call 025",
    "Summary": "**Ethereum Consensus Layer Core Developers Meeting Summary**\n\nThe Ethereum core developers' call focused primarily on protocol decisions and EIP discussions, with a significant emphasis on **EIP-4848**, which proposes to introduce a new type of transaction called \"blob transactions.\" The proposal aims to improve the efficiency of data processing by allowing for more flexible and compact encoding. After thorough discussion, it was decided that EIP-4848 will be implemented in Ethereum 2.0's Bellatrix upgrade (version **1.3**), with an expected deployment date set for Q4 this year.\n\nRegarding technical issues, a critical bug affecting the Beacon Chain's shard proposal mechanism was identified and addressed by implementing a fix in version **1.2.5-alpha**, which is currently undergoing testing. The developers also discussed potential solutions to mitigate gas costs associated with sharding, but no concrete decisions were made at this meeting.\n\nIn terms of development milestones and testing updates, the team reported progress on integrating EIP-4848 into Bellatrix's codebase. Testing has been ongoing since **August 15th**, with a focus on ensuring seamless integration between blob transactions and existing functionality. The developers also discussed plans to conduct thorough security audits before deploying the upgrade.\n\nClient implementation progress was noted as steady, with several clients (e.g., Lighthouse) actively working towards implementing EIP-4848 in their codebases. However, some concerns were raised regarding potential compatibility issues that may arise from integrating blob transactions into existing client architectures.\n\nAction items and upcoming deadlines include finalizing the Bellatrix upgrade's release candidate by **September 15th** and conducting a security audit before deployment. The team will also continue testing EIP-4848 integration in preparation for its expected Q4 rollout."
}