{
    "Datetime": "2022-08-11 14:00:00+00:00",
    "Meeting": "Consensus Layer Call 093",
    "Summary": "**Consensus Layer Call 93 Summary**\n\nThe Ethereum Consensus Layer core developers met for call number 93, focusing on several critical topics that will shape the future of the network. The discussion centered around **Protocol decisions and EIP discussions**, where the team reviewed proposals to improve the Beacon Chain's performance and scalability.\n\nOne notable proposal is the implementation of **EIP-4846: Blob Storage** (version 1.0), which aims to reduce gas costs for data storage on-chain by utilizing a new type of transaction called \"blob transactions.\" The developers discussed potential issues with this EIP, including its impact on network congestion and security.\n\nRegarding **Technical issues, bugs, and proposed solutions**, the team addressed concerns about the recent increase in Beacon Chain's block time variability. This issue is attributed to changes in the network's difficulty adjustment mechanism. To mitigate it, a proposal was made to adjust the `CHURN_RATE` parameter (currently set at 0.1) to reduce the frequency of adjustments.\n\n**Development milestones and testing updates** revealed that the team has been working on implementing **Ethereum 2.0 Phase 3**, which includes the introduction of shard chains. The developers reported progress in integrating sharding with existing Beacon Chain functionality, but acknowledged challenges related to data availability sampling (DAS) implementation.\n\nThe meeting concluded with a review of **Action items and upcoming deadlines**. Key tasks include finalizing EIP-4846's specification by call 94 and initiating testing for the updated `CHURN_RATE` parameter within two weeks. The team also agreed on conducting regular performance monitoring to ensure that recent changes do not negatively impact network stability.\n\nOverall, this meeting highlighted significant progress toward improving Ethereum's scalability and security features while emphasizing ongoing efforts to address technical challenges arising from these developments."
}