{
    "Datetime": "2022-12-01 14:00:00+00:00",
    "Meeting": "Consensus Layer Call 099",
    "Summary": "**Consensus Layer Call 99 Summary**\n\nThe Ethereum Consensus Layer core developers met for their 99th call, focusing on several critical topics that will shape the future of the network. **Protocol decisions and EIP discussions** took center stage as the team debated the implementation details of EIP-4848 (Proto-Danksharding), a key upgrade aimed at increasing scalability. The discussion centered around the optimal gas pricing model for this new feature, with some developers advocating for a more aggressive approach to incentivize adoption.\n\nIn terms of **technical issues and bugs**, the group addressed several outstanding problems related to the upcoming Berlin hardfork (Ethereum 1.x). Specifically, they discussed potential solutions for mitigating the impact of a recently discovered bug in the EVM's `SSTORE` opcode. The team also reviewed progress on implementing the \"difficulty bomb\" fix, which is expected to be included in the next major release.\n\n**Development milestones and testing updates** revealed that several clients are nearing completion of their Berlin hardfork implementations. Go-Ethereum (geth) has already merged a significant portion of the necessary changesets, while Nethermind's implementation is also making good progress. The team emphasized the importance of thorough testing to ensure a smooth transition.\n\nThe meeting concluded with an overview of **client implementation progress**, highlighting notable advancements in several areas. Notably, Prysmatic Labs' client has made strides in implementing EIP-4848, while Lighthouse developers are working on integrating the new feature into their codebase. The team also assigned action items and set upcoming deadlines for key tasks related to Berlin hardfork testing and Proto-Danksharding implementation.\n\n**Action Items & Upcoming Deadlines**\n\n* Finalize gas pricing model for EIP-4848 by Consensus Layer Call 100\n* Complete difficulty bomb fix implementation in time for the next major release (targeted for Q2)\n* Conduct thorough testing of Berlin hardfork and Proto-Danksharding features"
}