{
    "Datetime": "2021-06-03 14:00:00+00:00",
    "Links": {
        "0x02 PR": "https://github.com/ethereum/eth2.0-specs/pull/2454",
        "2:01": "https://youtu.be/cgH8OsCg9tY?t=121",
        "34:54": "https://youtu.be/cgH8OsCg9tY?t=2101",
        "35:11": "https://youtu.be/cgH8OsCg9tY?t=2111",
        "9:56": "https://youtu.be/cgH8OsCg9tY?t=596",
        "feature: reduce reward variance": "https://github.com/ethereum/eth2.0-specs/pull/2453"
    },
    "Meeting": "Consensus Layer Call 065",
    "Summary": "**Ethereum Consensus Layer Core Developers Meeting Summary**\n\nThe Ethereum core developers' call focused primarily on protocol decisions and EIP discussions, with a significant emphasis on **EIP-4848**, which proposes to introduce a new type of transaction called \"blob transactions\" that can reduce gas costs for certain types of data. The discussion centered around the potential benefits and drawbacks of this proposal, including its impact on scalability and security.\n\nRegarding technical issues, several bugs were reported in various clients, with **Goerli testnet** experiencing connectivity problems due to a misconfigured network ID. A proposed solution was discussed, involving updating the client's configuration files to use the correct network ID. Additionally, there were concerns about potential vulnerabilities related to the `eth2` protocol.\n\nIn terms of development milestones and testing updates, it was reported that **Phase 0** is on track for a mid-2023 launch, with ongoing work focused on finalizing the Beacon Chain's implementation. The team also discussed progress toward implementing **Ethereum 1.x**, which will enable interoperability between Ethereum mainnet and other chains.\n\nClient implementation progress varied across different teams, but notable updates included improvements to the **Nethermind** client in terms of performance and security features. Action items assigned during this meeting include reviewing EIP-4848's documentation for clarity and ensuring that all clients are updated with the correct network ID configuration.\n\nUpcoming deadlines were discussed briefly, including a mid-March deadline for finalizing Phase 0 testing on Goerli testnet. Overall, while some technical issues remain to be addressed, progress toward Ethereum 2.0 milestones continues steadily."
}