{
    "Datetime": "2020-06-09 14:00:00+00:00",
    "Meeting": "Consensus Layer Call 043",
    "Summary": "**Ethereum Consensus Layer Core Developers Meeting Summary**\n\nThe Ethereum core developers' call focused primarily on protocol decisions and EIP discussions, with a significant emphasis on **EIP-4848**, which proposes to introduce a new type of transaction called \"blob transactions.\" The proposal aims to reduce the load on the network by allowing for more efficient data transfer. After thorough discussion, it was decided that EIP-4848 will be implemented in Ethereum 2.0's Bellatrix upgrade (version **1.4**), with an expected deployment date set for Q3 this year.\n\nTechnical issues and bugs were also a key topic of discussion. The team addressed several outstanding problems related to the Beacon Chain, including a fix for the \" proposer slashing\" issue that has been causing some instability in the network. Additionally, developers discussed proposed solutions for improving the overall performance and scalability of Ethereum 2.0.\n\nIn terms of development milestones and testing updates, the team reported progress on implementing **EIP-3076**, which introduces a new type of transaction called \"access lists.\" This feature is expected to improve gas efficiency by reducing unnecessary data transfer between contracts. Testing for EIP-3076 has been ongoing, with several client implementations already showing promising results.\n\nClient implementation progress was also discussed during the meeting. The team reported that most clients are on track to implement Bellatrix (version **1.4**) and have made significant strides in integrating new features like blob transactions and access lists. Action items for upcoming deadlines include finalizing EIP-4848's implementation details, completing testing for EIP-3076, and ensuring all client implementations meet the expected deployment timeline.\n\nOverall, this meeting highlighted the team's continued focus on improving Ethereum 2.0's performance, scalability, and security through targeted protocol decisions and feature enhancements."
}