{
    "Datetime": "2021-03-25 14:00:00+00:00",
    "Meeting": "Consensus Layer Call 060",
    "Summary": "**Ethereum Consensus Layer Core Developers Meeting Summary**\n\nThe Ethereum core developers' consensus layer meeting focused primarily on protocol decisions and EIP discussions, with a significant emphasis on **EIP-4848**, which proposes to introduce data availability sampling for the Beacon Chain. The proposal aims to improve scalability by reducing the amount of data that needs to be stored in the blockchain's state tree. After thorough discussion, it was decided to move forward with implementing this EIP.\n\nRegarding technical issues and bugs, a critical **issue related to the LMD-GHOST fork** was addressed. A proposed solution involves updating the `get_block_hash` function to correctly handle the new forked chain. This fix is expected to be implemented in the upcoming release of Goerli testnet (version 1.2). Additionally, discussions centered around a potential **bug affecting the Beacon Chain's proposer selection**, which may lead to an increase in block production times.\n\nDevelopment milestones and testing updates highlighted several key achievements. The implementation of EIP-4848 is expected to be completed by Q3 this year, with Goerli testnet serving as the primary testing ground for its integration. Furthermore, a **new version (1.2) of the Beacon Chain's client software** has been released, featuring improvements in performance and security.\n\nClient implementation progress was also discussed during the meeting. The development teams are working on integrating EIP-4848 into their respective clients, with notable updates from Prysmatic Labs' `prysm` (version 1.2) and Lighthouse's `lighthouse` (version 5.0). Action items include finalizing the implementation of EIP-4848 by Q3 and conducting thorough testing on Goerli testnet.\n\nThe meeting concluded with a review of upcoming deadlines, including the expected release dates for new client versions and milestones related to EIP-4848's integration into production environments."
}