{
    "Datetime": "2025-01-09 14:00:00+00:00",
    "Meeting": "Consensus Layer Call 149",
    "Summary": "**Consensus Layer Call 149 Summary**\n\nThe Ethereum Consensus Layer core developers met for call number 149, focusing on several critical topics that will shape the future of the network. The discussion centered around **Protocol decisions and EIP discussions**, with a key highlight being the ongoing debate surrounding the implementation of EIP-4844 (Proto-Danksharding). This proposal aims to improve scalability by introducing a new type of transaction called \"proto-dank shards.\" After reviewing various concerns, including gas costs and potential security risks, the developers decided to proceed with implementing EIP-4844 in Ethereum 2.0's Bellatrix phase.\n\n**Technical issues, bugs, and proposed solutions** were also discussed during the call. The team addressed a critical bug affecting the Beacon Chain's proposer selection mechanism. A fix was agreed upon, which will be implemented in an upcoming release (version v1.3.4). Additionally, developers reviewed ongoing efforts to resolve memory leaks in the execution layer.\n\nThe meeting covered **development milestones and testing updates**, with notable progress reported on the implementation of EIP-4844's precursor, EIP-4488 (Proto-Danksharding for Execution Layers). The team is working towards a mid-April release date. Furthermore, developers discussed ongoing performance optimizations in the execution layer.\n\n**Client implementation progress** was also reviewed during the call. Lighthouse and Nimbus clients are making steady progress with implementing EIP-4844's changes. However, some concerns were raised regarding potential compatibility issues between different client implementations.\n\nThe meeting concluded with **action items and upcoming deadlines**, including a review of the Beacon Chain's proposer selection mechanism fix (due by March 31st) and ongoing testing for EIP-4488 implementation. The next call is scheduled to take place on April 7th, where further discussions will focus on finalizing the Bellatrix phase release plan."
}