{
    "Datetime": "2023-07-13 14:00:00+00:00",
    "Meeting": "Consensus Layer Call 113",
    "Summary": "**Summary of Consensus Layer Call 113**\n\nThe Ethereum core developers' call focused primarily on protocol decisions and EIP discussions, with a significant emphasis on **EIP-4848**, which proposes to introduce a new type of transaction called \"blobs\" that can be processed more efficiently than traditional transactions. The discussion centered around the potential benefits of this proposal, including improved scalability and reduced gas costs.\n\nRegarding technical issues and bugs, the team addressed several concerns related to **Beacon Chain version 1.2**, which is currently in testing phase. A critical bug was identified affecting the chain's ability to process certain types of blocks efficiently. The developers proposed a patch that would resolve this issue but require an upgrade to Beacon Chain protocol.\n\nThe call also covered development milestones and testing updates, with **Beacon Chain version 1.3** being targeted for release in approximately two weeks' time. This new version aims to address several outstanding issues, including the aforementioned bug affecting block processing efficiency. The team reported that testing is progressing smoothly, but some minor delays are expected due to ongoing optimization efforts.\n\nClient implementation progress was also discussed during the call. **Go-Ethereum (Geth)** and **Nethermind** clients have both made significant strides in implementing Beacon Chain protocol updates. However, a few issues remain unresolved, particularly with regards to handling certain edge cases related to block processing.\n\nAction items assigned from this meeting include finalizing EIP-4848's implementation details by the end of next week and completing testing for Beacon Chain version 1.3 within two weeks' time. The team will reconvene in a fortnight to review progress on these tasks and discuss any emerging concerns or issues that may arise during development."
}