{
    "Datetime": "2021-07-01 14:00:00+00:00",
    "Meeting": "Consensus Layer Call 067",
    "Summary": "**Ethereum Consensus Layer Core Developers Meeting Summary**\n\nThe Ethereum core developers' call focused primarily on protocol decisions and EIP discussions, with a significant emphasis on **EIP-4848**, which proposes to introduce data availability sampling for the Beacon Chain. The proposal aims to reduce gas costs by allowing clients to verify only a subset of blocks instead of all transactions. After thorough discussion, it was decided that EIP-4848 will be implemented in Ethereum 2.0's Phase 1.5.\n\nRegarding technical issues and bugs, several were addressed during the call. Notably, **the issue with `get_block_hash` function** has been resolved by updating the Beacon Chain to version v0.12.3. Additionally, a fix for the \"missing block\" error was implemented in the Lighthouse client (version 5.1.2). The team also discussed and proposed solutions for several other bugs.\n\nDevelopment milestones were reviewed during the call, with an update on testing progress provided by various clients. **The Prysm client has completed its Phase 0 testing**, while the Teku client is nearing completion of their own Phase 0 tests. Lighthouse's Phase 1 testing is ongoing and expected to be finished soon.\n\nClient implementation progress was also discussed during the call, with a focus on ensuring compatibility between different clients as they move towards implementing EIP-4848. Action items were assigned for each team member to review client implementations and ensure that all necessary changes are made before the upcoming deadline of **April 15th**. This will allow for smooth integration of Phase 1.5 features into the Beacon Chain.\n\nOverall, this meeting highlighted significant progress in addressing technical issues and implementing new protocol decisions. The focus on EIP-4848 is expected to have a substantial impact on Ethereum's scalability and gas efficiency moving forward."
}