{
    "Datetime": "2022-11-03 14:00:00+00:00",
    "Meeting": "Consensus Layer Call 097",
    "Summary": "**Consensus Layer Call 97 Summary**\n\nThe Ethereum Consensus Layer core developers met for their 97th call, focusing on several critical topics that will shape the future of the network. The discussion centered around **Protocol decisions and EIP discussions**, with a key highlight being the ongoing debate surrounding the implementation of EIP-4846 (Proto-Danksharding). This proposal aims to increase scalability by introducing a new type of transaction called \"proto-dank shards.\" After thorough review, it was decided that further testing is required before making any final decisions.\n\n**Technical issues and proposed solutions** were also discussed in detail. The team addressed several bugs reported across various clients, including the Geth client's issue with incorrect gas accounting for certain types of transactions. A patch has been submitted to fix this bug, which will be reviewed and merged into the main branch soon. Additionally, a new version (v1.10.11) of the Besu client was released, addressing several critical issues reported by users.\n\n**Development milestones and testing updates** were also covered during the call. The team is making progress on implementing EIP-4846 in various clients, with Geth aiming to have it ready for mainnet deployment within the next few weeks. Meanwhile, a new testnet (Ropsten) has been set up specifically for testing proto-dank shards.\n\n**Client implementation progress** was also discussed during the call. The team is working closely together to ensure that all clients are compatible with each other and can seamlessly integrate EIP-4846 once it's implemented. **Action items and upcoming deadlines** were assigned, including a review of the Geth patch for gas accounting bug by March 15th.\n\nOverall, this meeting highlighted significant progress towards implementing proto-dank shards on Ethereum, which will greatly enhance scalability and usability of the network."
}