{
    "Datetime": "2021-05-20 14:00:00+00:00",
    "Meeting": "Consensus Layer Call 063",
    "Summary": "**Ethereum Consensus Layer Core Developers Meeting Summary**\n\nThe Ethereum core developers' call focused primarily on protocol decisions and EIP discussions, with a significant emphasis on **EIP-4848**, which proposes to introduce data availability sampling for the Beacon Chain. The proposal aims to reduce gas costs by allowing clients to verify only a subset of blocks instead of all transactions. After thorough discussion, it was decided that EIP-4848 will be implemented in Ethereum 2.0's Phase 1.5.\n\nRegarding technical issues and bugs, several were reported during the meeting. Notably, **the `get_block_hash` function** has been identified as a potential source of errors due to its inconsistent behavior across different clients. A proposed solution involves revising the function to ensure consistency with other Beacon Chain APIs. Additionally, discussions centered around resolving an issue related to **gas limit calculations**, which may lead to incorrect gas limits being set for certain transactions.\n\nDevelopment milestones and testing updates were also discussed during the meeting. The team is on track to meet its goal of implementing EIP-4848 in Phase 1.5, with a target release date of Q2 2023 (Ethereum 2.0's **Bellatrix** upgrade). Testing for this phase has begun and will continue over the coming weeks.\n\nClient implementation progress was also covered during the meeting. Several clients are actively working on implementing EIP-4848, including Lighthouse and Prysm. However, some concerns were raised regarding potential compatibility issues between different client implementations of the proposed data availability sampling mechanism.\n\nAction items assigned to team members include revising the `get_block_hash` function and finalizing gas limit calculations for Phase 1.5's implementation. The next meeting will focus on reviewing progress made since the last call, with a specific emphasis on resolving any outstanding issues related to EIP-4848."
}