{
    "Datetime": "2021-10-21 14:00:00+00:00",
    "Meeting": "Consensus Layer Call 073",
    "Summary": "**Summary of Consensus Layer Call 73**\n\nThe Ethereum core developers' call focused primarily on protocol decisions and EIP discussions, with a significant emphasis on **EIP-4846**, which proposes to introduce a new type of transaction called \"blobs\" that can be processed more efficiently than traditional transactions. The discussion centered around the potential benefits of this proposal, including improved scalability and reduced gas costs.\n\nRegarding technical issues, several bugs were reported in various clients, with notable mentions being **Geth 1.10.8** and **Nethermind 0.7.2-rc.3**, which are currently experiencing memory leaks under certain conditions. Proposed solutions involve updating the affected code to address these issues. Additionally, there was a discussion on implementing **EIP-3675**, which aims to improve the handling of uncle blocks in Ethereum's consensus mechanism.\n\nDevelopment milestones and testing updates were also discussed during the call. The team is working towards releasing **Beacon Chain v0.12** soon, with an expected timeline of 2 weeks from now. This release will include several bug fixes and performance improvements. Furthermore, there was a mention of ongoing testing for **EIP-4846**, which has shown promising results in terms of scalability.\n\nClient implementation progress varied across different clients, but most are on track to implement the upcoming Beacon Chain v0.12 release. Notably, **Lighthouse 5.1** is currently experiencing some issues with its integration of EIP-3675 and will require further testing before being considered stable.\n\nAction items assigned during the call include finalizing the implementation details for EIP-4846 and addressing the reported bugs in Geth and Nethermind clients. The next meeting's agenda has been set, focusing on reviewing progress made since Call 73 and discussing any new proposals or concerns that have arisen."
}