{
    "Datetime": "2022-09-08 14:00:00+00:00",
    "Links": {
        "https://ethernodes.org/merge": "https://ethernodes.org/merge",
        "https://ethresear.ch/t/removing-trusted-relays-in-mev-boost-using-threshold-encryption/13449": "https://ethresear.ch/t/removing-trusted-relays-in-mev-boost-using-threshold-encryption/13449",
        "https://github.com/NethermindEth/sedge": "https://github.com/NethermindEth/sedge",
        "https://github.com/ethereum/pm/issues/594#issuecomment-1206713478": "https://github.com/ethereum/pm/issues/594#issuecomment-1206713478",
        "https://github.com/ethereum/pm/issues/594#issuecomment-1211765927": "https://github.com/ethereum/pm/issues/594#issuecomment-1211765927",
        "https://github.com/ethereum/pm/issues/599": "https://github.com/ethereum/pm/issues/599",
        "https://hackmd.io/@inphi/SJMXL1P6c#Endpoints": "https://hackmd.io/@inphi/SJMXL1P6c#Endpoints",
        "https://hackmd.io/_3lpo0FzRNa1l7XB0ELH7Q?view": "https://hackmd.io/_3lpo0FzRNa1l7XB0ELH7Q?view",
        "https://twitter.com/SomerEsat/status/1562541042120814592": "https://twitter.com/SomerEsat/status/1562541042120814592",
        "https://twitter.com/nethermindeth/status/1555571498894725123": "https://twitter.com/nethermindeth/status/1555571498894725123"
    },
    "Meeting": "Consensus Layer Call 094",
    "Summary": "**Summary of Consensus Layer Call 94**\n\nThe Ethereum core developers' call focused primarily on protocol decisions and EIP discussions, with a significant emphasis on **EIP-4846**, which proposes to introduce \"blobs\" as a new type of transaction data in the Ethereum network. The discussion centered around its implementation details, including gas pricing models and potential security implications.\n\nRegarding technical issues, several bugs were reported across various clients, including Go-Ethereum (Geth) and Parity. A proposed solution for one such bug involved updating the `keccak256` function to use a more efficient algorithm, which is expected to improve performance by up to 20%. The developers also discussed potential solutions for mitigating the impact of \"reorgs\" on network stability.\n\nIn terms of development milestones and testing updates, it was noted that **Ethereum 2.0 Phase 1** (Beacon Chain) has reached a critical milestone with over 50% of validators online. The team is now focusing on completing the final stages of Beacon Chain deployment before transitioning to Phase 2.\n\nClient implementation progress varied across different clients, but Parity reported significant advancements in implementing EIP-4846 and other upcoming features. Go-Ethereum's development pace was noted as steady, with ongoing work on improving performance and security.\n\nAction items assigned during the call include reviewing proposed changes for EIP-4846 by **March 15th** and conducting a thorough review of Beacon Chain deployment before transitioning to Phase 2. The next meeting is scheduled for March 22nd, where these updates will be discussed further."
}