{
    "Datetime": "2022-08-11 14:00:00+00:00",
    "Meeting": "Consensus Layer Call 095",
    "Summary": "**Consensus Layer Call 95 Summary**\n\nThe Ethereum Consensus Layer core developers met for call number 95, focusing on several critical topics that will shape the future of the network. **Protocol decisions and EIP discussions** took center stage as the team debated the implementation details of EIP-4848 (Proto-Danksharding). After a thorough discussion, it was decided to proceed with implementing this proposal in Ethereum's upcoming Shanghai hardfork (version 1.2), scheduled for April 2023.\n\nRegarding **technical issues and bugs**, several clients reported progress on resolving outstanding problems. For instance, the Geth client has made significant strides in fixing memory leaks that were causing performance degradation. Meanwhile, the Nethermind team is working to address a critical issue with their implementation of EIP-1559 (London hardfork). The developers acknowledged these efforts and encouraged continued collaboration among clients.\n\n**Development milestones and testing updates** highlighted several notable achievements. The Ethereum Foundation's testnet upgrade has been successfully completed, paving the way for more extensive testing before Shanghai's deployment. Additionally, a new version of the Prysm client was released (version 1.0.4), which includes bug fixes and performance enhancements.\n\nIn terms of **client implementation progress**, several clients reported steady advancements in implementing EIP-4848 features. The Teku team has made significant strides in integrating Proto-Danksharding, while other clients are working to catch up on the development pace. Finally, the meeting concluded with a review of **action items and upcoming deadlines**. Key tasks include finalizing Shanghai's testnet deployment by March 2023 and completing EIP-4848 implementation before April's hardfork.\n\nOverall, this call demonstrated the collaborative spirit among Ethereum core developers as they work towards implementing critical upgrades to improve network performance and scalability."
}