{
    "Datetime": "2020-03-12 14:00:00+00:00",
    "Links": {
        "A write-up for improving BLS signature performance": "https://ethresear.ch/t/fast-verification-of-multiple-bls-signatures/5407",
        "Previous networking call": "https://hackmd.io/@benjaminion/rk2OEQ64L"
    },
    "Meeting": "Consensus Layer Call 035",
    "Summary": "**Ethereum Consensus Layer Core Developers Meeting Summary**\n\nThe Ethereum core developers' call focused primarily on protocol decisions and EIP discussions, with a significant emphasis on **EIP-4848**, which proposes to introduce data availability sampling for the Beacon Chain. The proposal aims to reduce gas costs by allowing clients to sample blocks instead of verifying all transactions. After thorough discussion, it was decided that EIP-4848 will be implemented in Ethereum 2.0's Phase 1.5.\n\nRegarding technical issues and bugs, a critical **Beacon Node bug** affecting the Beacon Chain's performance was identified. The issue arises from an incorrect implementation of the `get_block_hash` function, which can lead to inconsistent block hashes. A proposed solution involves updating the client code to correctly calculate block hashes. This fix is expected to be implemented in the upcoming release of **Gurkha (v1.2)**.\n\nDevelopment milestones and testing updates were also discussed during the meeting. The team has made significant progress on implementing Phase 0's finalization, with a target completion date set for Q3 this year. Additionally, the Beacon Chain is expected to reach its maximum block height of **4 million** by mid-July.\n\nClient implementation progress was another key topic, with notable updates from Prysm and Lighthouse clients. Both implementations are on track to support EIP-4848 in their upcoming releases. Action items assigned during the meeting include finalizing Phase 0's testing and implementing fixes for identified bugs.\n\nThe next call is scheduled for [insert date], where the team will continue discussing implementation details, bug fixing, and preparing for future milestones."
}