{
    "Datetime": "2023-02-23 14:00:00+00:00",
    "Meeting": "Consensus Layer Call 105",
    "Summary": "**Consensus Layer Call 105 Summary**\n\nThe Ethereum Consensus Layer core developers met for call number 105, focusing on several critical topics that will shape the future of the network. **Protocol decisions and EIP discussions** took center stage as the team debated the implementation details of EIP-4848 (Proto-Danksharding). After a thorough discussion, it was decided to proceed with implementing this proposal in Ethereum's upcoming Shanghai hardfork (version 1.2), which is scheduled for release on April 12th.\n\nRegarding **technical issues and bugs**, several clients reported encountering problems related to the recent upgrade of the Beacon Chain protocol. The team identified potential solutions and assigned action items to resolve these issues before the next major update. Notably, Lighthouse client developers are working on a fix for their implementation's memory leak issue (tracked as #3843).\n\n**Development milestones and testing updates** highlighted several notable achievements in recent weeks. The Beacon Chain has successfully completed its 10th epoch of sharding experiments with EIP-4848 enabled, demonstrating improved performance and scalability. Additionally, the team reported progress on implementing the \"shard data availability\" (SDA) feature, which will enable more efficient storage and retrieval of shard-specific data.\n\n**Client implementation progress** showed that most clients are making good headway in integrating the latest protocol updates. However, Lighthouse developers mentioned they still need to resolve their memory leak issue before fully supporting EIP-4848. The team also discussed upcoming deadlines for client implementations, with a focus on ensuring all major clients can support the Shanghai hardfork by its scheduled release date.\n\n**Action items and upcoming deadlines** were assigned to several participants, including resolving outstanding technical issues and finalizing client implementation plans. With only two weeks left before the Shanghai hardfork, the team will continue working diligently to ensure a smooth transition for Ethereum's network upgrade."
}