{
    "Datetime": "2023-05-18 14:00:00+00:00",
    "Meeting": "Consensus Layer Call 109",
    "Summary": "**Consensus Layer Call 109 Summary**\n\nThe Ethereum Consensus Layer core developers met for call number 109, focusing on several critical topics that will shape the future of the network. **Protocol decisions and EIP discussions** took center stage as the team debated the implementation details of EIP-4848 (Proto-Danksharding), a significant upgrade aimed at improving scalability. The discussion centered around the optimal gas pricing model for this new feature, with some participants advocating for a more aggressive approach to incentivize adoption.\n\nIn terms of **technical issues and bugs**, several clients reported encountering difficulties in implementing recent changes. For instance, Lighthouse developers encountered an issue related to the handling of empty blocks, which was subsequently addressed through collaboration among team members. The meeting also touched on ongoing efforts to resolve a long-standing problem with the Beacon Chain's gas limit calculation.\n\n**Development milestones and testing updates** highlighted several notable achievements. The Ethereum 2.0 testnet has been upgraded to version \"Zinken\" (v1.3), which includes improvements in client stability and performance. Additionally, the team reported progress on implementing EIP-4848 in various clients, with some already demonstrating successful integration.\n\nRegarding **client implementation progress**, Lighthouse developers announced that their latest release (version 5.2) now supports Proto-Danksharding. However, other clients like Prysm and Teku are still working through the complexities of this new feature. The meeting concluded with a review of outstanding action items and upcoming deadlines for implementing EIP-4848 across all major clients.\n\n**Action Items and Upcoming Deadlines**\n\n* Finalize gas pricing model for Proto-Danksharding (EIP-4848)\n* Resolve Beacon Chain's gas limit calculation issue\n* Complete implementation of EIP-4848 in Prysm, Teku, and other clients\n\nThe next Consensus Layer call is scheduled to take place on [insert date]."
}