{
    "Datetime": "2021-06-03 14:00:00+00:00",
    "Meeting": "Consensus Layer Call 064",
    "Summary": "**Ethereum Consensus Layer Core Developers Meeting Summary**\n\nThe Ethereum core developers' call focused primarily on **Protocol decisions and EIP discussions**, with a significant emphasis on EIP-4848, which proposes to introduce \"blob storage\" for improved scalability. The discussion centered around the potential benefits of this feature, including reduced gas costs and increased transaction capacity. A consensus was reached that blob storage will be implemented in Ethereum 2.0's Phase 1.5 upgrade.\n\nRegarding **Technical issues, bugs, and proposed solutions**, a critical bug affecting the Beacon Chain's attestations processing was identified and discussed. The developers agreed to implement a temporary fix until a more comprehensive solution can be developed. Additionally, there were discussions around improving the performance of the Ethereum 2.0 client by optimizing its memory usage.\n\n**Development milestones and testing updates** highlighted several key achievements: the completion of Phase 1's testnet deployment on Goerli (a fork of Ropsten), which will serve as a staging ground for further development; and the ongoing work towards implementing EIP-4848 in the Beacon Chain. The developers also discussed plans to conduct thorough testing before proceeding with any major upgrades.\n\n**Client implementation progress** showed that most clients are now aligned on implementing Phase 1's features, including blob storage. However, some discrepancies were noted regarding the optimal configuration for this feature. To address these differences and ensure a smooth transition, an action item was assigned to investigate further.\n\nThe meeting concluded with several **Action items and upcoming deadlines**, primarily focusing on resolving outstanding technical issues related to EIP-4848's implementation and optimizing client performance. The next call will review progress made towards addressing these concerns and discuss any new developments or challenges arising from ongoing testing efforts."
}