{
    "Datetime": "2020-06-26 14:00:00+00:00",
    "Meeting": "Execution Layer Meeting 90",
    "Summary": "**Summary of All Core Devs Meeting MEETING_NUM**\n\nThe primary focus area for this meeting was **Protocol decisions and EIP discussions**, with a significant emphasis on Ethereum Improvement Proposals (EIP) related to sharding, specifically EIP-4844: Base Fee Market Size Estimation. The discussion centered around the proposal's implications on gas pricing and market dynamics.\n\nIn terms of technical issues, several bugs were reported in various clients, including **Geth** version 1.10.6, which is currently experiencing a memory leak issue affecting large-scale deployments. A proposed solution involves implementing a new garbage collection mechanism to mitigate this problem. Additionally, the team discussed ongoing efforts to resolve an issue with **Parity**'s transaction queue.\n\nRegarding development milestones and testing updates, the meeting highlighted progress on sharding-related features in various clients. Notably, **Nethermind** has made significant strides in implementing EIP-4844, while **Besu** is working towards integrating a new caching mechanism to improve performance. Testing efforts are ongoing, with a focus on stress-testing and edge-case scenarios.\n\nClient implementation progress was also discussed, with an emphasis on the need for more comprehensive testing across all clients. The team acknowledged that further collaboration between client developers would be beneficial in ensuring seamless integration of sharding features.\n\nAction items assigned during this meeting include:\n\n* EIP-4844: Finalize proposal and submit to Ethereum Improvement Proposal (EIP) repository\n* Geth memory leak issue: Implement new garbage collection mechanism for version 1.10.x releases\n\nUpcoming deadlines were not explicitly mentioned, but the team is expected to continue working towards sharding-related milestones in preparation for upcoming network upgrades."
}