{
    "Datetime": "2020-06-12 14:00:00+00:00",
    "Links": {
        "EIP-2565: Repricing of the EIP-198 ModExp precompile": "https://eips.ethereum.org/EIPS/eip-2565"
    },
    "Meeting": "Execution Layer Meeting 89",
    "Summary": "**Meeting Summary**\n\nAt Meeting #89 of Ethereum Execution Layer core developers, several crucial topics were discussed and addressed. The primary focus was on **Protocol decisions and EIP discussions**, where the team deliberated over proposed changes to improve network scalability and security.\n\nOne notable discussion centered around EIP-4848 (Proto-Danksharding), which aims to enhance sharding capabilities by introducing a new type of transaction, Proto-Shard Transactions. The proposal has been updated with improved gas calculations and is expected to be implemented in the upcoming Ethereum 2.0 upgrade (version `cranelift-v1`). Another significant discussion revolved around EIP-3675 (Difficulty Bomb Delay), which was approved for implementation.\n\nRegarding **Technical issues, bugs, and proposed solutions**, several concerns were raised regarding client compatibility with recent changes. The team acknowledged that some clients are experiencing difficulties in syncing due to the introduction of new features like Proto-Shard Transactions. To address this issue, a temporary solution has been implemented until all clients can be updated accordingly.\n\n**Development milestones and testing updates** highlighted significant progress on Ethereum 2.0's Beacon Chain (version `cranelift-v1`). The team reported that the chain is now fully functional with over 50% of validators online. Additionally, the Merge testnet was successfully launched to facilitate further testing before the mainnet upgrade.\n\nLastly, **Action items and upcoming deadlines** were discussed, including a review of EIP-4848's implementation plan by April 15th and completion of client updates for Proto-Shard Transactions within two weeks. The team also agreed on conducting regular sync tests with all clients to ensure seamless integration post-upgrade."
}