{
    "Datetime": "2019-08-15 22:00:00+00:00",
    "Links": {
        "EIP-1884": "https://eips.ethereum.org/EIPS/eip-1884",
        "EIP-2200": "https://github.com/ethereum/EIPs/pull/2200"
    },
    "Meeting": "Execution Layer Meeting 68",
    "Summary": "**Ethereum Core Devs Meeting <MEETING_NUM> Summary**\n\nThe Ethereum core developers' meeting focused primarily on protocol decisions and EIP discussions, with a significant emphasis on **EIP-4848**, which proposes the introduction of a new type of transaction called \"blobs\" to improve scalability. The discussion centered around addressing concerns regarding gas costs, security implications, and potential interactions with other upcoming upgrades like **Shapella** (Layer 2). After thorough deliberation, it was decided that EIP-4848 will be implemented in the next major release, Ethereum 2.x.\n\nRegarding technical issues and bugs, a notable discussion revolved around resolving an issue affecting **Beacon Chain's** performance. The team identified the root cause as a misconfigured parameter and proposed adjustments to mitigate its impact on network efficiency. Additionally, several client implementation progress updates were shared, with **Lighthouse**, **Nethermind**, and **Teku** reporting advancements in their respective implementations.\n\nDevelopment milestones and testing updates highlighted significant strides toward completing key components for Ethereum 2.x's release. The team is working diligently to finalize the Beacon Chain upgrade, which will enable sharding and improve overall scalability. Notably, a new testnet was launched to facilitate thorough testing of EIP-4848 before its integration into mainnet.\n\nAction items and upcoming deadlines were also discussed during the meeting. Key takeaways include:\n\n* Finalizing EIP-4848 implementation for Ethereum 2.x release\n* Resolving Beacon Chain performance issues by adjusting misconfigured parameters\n* Continuing client implementation progress, with a focus on Lighthouse's sharding capabilities\n\nThe next core devs' meeting will be held in two weeks to review the status of these action items and discuss further developments."
}