{
    "Datetime": "2017-07-14 14:00:00+00:00",
    "Links": {
        "From this Reddit comment": "https://www.reddit.com/r/ethereum/comments/6n71f6/live_stream_ethereum_core_developer_meeting_20_in/dk7t210/"
    },
    "Meeting": "Execution Layer Meeting 20",
    "Summary": "**Ethereum Core Devs Meeting #20 Summary**\n\nThe Ethereum core developers' meeting #20 focused primarily on protocol decisions and EIP discussions, with a significant emphasis on **EIP-4848**, which proposes to introduce a new type of transaction called \"blobs\" that can be processed more efficiently. The discussion centered around the potential benefits of this proposal in terms of scalability improvements.\n\nRegarding technical issues, several bugs were reported across various clients, including Geth and Parity. A proposed solution for one such bug involved updating the `gas_limit` field to prevent overflows when calculating gas costs. Additionally, there was a brief review of **Ethereum 2.0's** (Serenity) development progress, with an update on the upcoming **Berlin hardfork**, scheduled for April 2021.\n\nIn terms of client implementation progress, it was noted that Geth and Parity are both making steady strides towards implementing EIP-1559, which aims to improve gas market efficiency. The discussion also touched upon the need for more comprehensive testing across clients before merging these changes into mainnets.\n\nAction items from this meeting include finalizing a timeline for reviewing **Ethereum 2.0's** (Serenity) testnet and conducting thorough security audits on proposed EIPs, particularly those related to scalability improvements like EIP-4848. The next core devs' meeting is scheduled in two weeks, with the primary focus being on addressing these outstanding action items.\n\nOverall, this meeting highlighted ongoing efforts towards improving Ethereum's scalability through various proposals while emphasizing the importance of thorough testing and security audits before implementing significant changes."
}