{
    "Datetime": "2021-11-12 14:00:00+00:00",
    "Meeting": "Execution Layer Meeting 126",
    "Summary": "**Summary of AllCoreDevs Meeting 126**\n\nThe primary focus area for this meeting was **Protocol decisions and EIP discussions**, with a significant emphasis on Ethereum Improvement Proposal (EIP) 4844, which aims to increase the block gas limit by introducing a new data structure called \"Proto-Danksharding.\" The proposal has been met with both enthusiasm and skepticism from core developers. After an in-depth discussion, it was decided that EIP-4844 will be implemented as part of Ethereum's upcoming Shanghai upgrade (version 1.2), pending further testing.\n\n**Technical issues, bugs, and proposed solutions** were also a key topic for this meeting. The team discussed several outstanding issues related to the execution layer, including problems with gas accounting in certain scenarios. A potential solution was presented by one developer, which involves modifying the way gas is calculated during contract execution. This proposal will be further explored and tested before being implemented.\n\nIn terms of **development milestones and testing updates**, it was reported that several clients are making progress towards implementing EIP-4844. The Go Ethereum (Geth) client has already started working on a prototype implementation, while the Parity client is expected to follow suit soon. Testing for these implementations will be crucial in ensuring their stability before deployment.\n\n**Client implementation progress** showed significant advancements across various clients. Geth and Parity are both making good headway with EIP-4844 integration, while other clients like Nethermind have started exploring the use of Proto-Danksharding as a potential solution for scalability issues.\n\nFinally, **action items and upcoming deadlines** were discussed briefly during this meeting. The team agreed to schedule an additional testing session in two weeks' time to ensure that all implementations are stable before deployment."
}