{
    "Datetime": "2021-04-23 14:00:00+00:00",
    "Links": {
        "40:03": "https://youtu.be/C9hzAYkklQM?t=2403",
        "44:54": "https://youtu.be/C9hzAYkklQM?t=2694",
        "Agenda": "https://github.com/ethereum/pm/issues/302"
    },
    "Meeting": "Execution Layer Meeting 111",
    "Summary": "**Summary of All Core Devs Meeting 111**\n\nThe primary focus area for this meeting was **Protocol decisions and EIP discussions**, with a significant emphasis on Ethereum Improvement Proposal (EIP) 4844, which aims to increase the block gas limit by introducing a new data structure called \"Proto-Danksharding\". The proposal has been met with both enthusiasm and skepticism from core developers. After thorough discussion, it was decided that further testing is required before making any decisions.\n\n**Technical issues, bugs, and proposed solutions** were also discussed at length. A critical bug in the Ethereum 1.x client implementation was identified and a patch was agreed upon to be implemented as soon as possible. Additionally, there have been ongoing discussions regarding the handling of \"revert\" data during state transitions, with several potential solutions being explored.\n\nRegarding **development milestones and testing updates**, it was reported that the Goerli testnet is now fully functional for EIP-4844 testing purposes. This will enable developers to thoroughly test the new protocol before its deployment on mainnet. Furthermore, a timeline has been set for the completion of the \"Merge\" (the transition from Proof-of-Work to Proof-of-Stake) with an estimated completion date in Q2 2023.\n\n**Client implementation progress** was also discussed during this meeting. The Ethereum 1.x client is nearing completion and will soon be released as a stable version, while other clients such as Besu are making steady progress towards full compatibility with the new protocol. \n\nLastly, **action items and upcoming deadlines** were outlined for core developers to focus on in the coming weeks. These include finalizing EIP-4844 testing, completing client implementation patches, and preparing for a potential mainnet deployment of the \"Merge\" by Q2 2023."
}