{
    "Datetime": "2020-02-05 14:00:00+00:00",
    "Meeting": "Execution Layer Meeting 105",
    "Summary": "**Summary of All Core Devs Meeting 105**\n\nThe primary focus area for this meeting was **Protocol decisions and EIP discussions**, with a significant emphasis on Ethereum Improvement Proposal (EIP) 4844, which aims to increase the block gas limit by introducing a new data structure called \"proto-danksharding.\" The proposal has been met with both enthusiasm and skepticism among core developers. After an in-depth discussion, it was decided that EIP-4844 will be implemented as part of Ethereum's upcoming Shanghai hardfork (version 1.2), scheduled for April 2023.\n\n**Technical issues, bugs, and proposed solutions** were also a key topic during the meeting. The team discussed several outstanding issues related to gas accounting and transaction processing. Notably, they addressed concerns regarding the \"gas cost model\" in EIP-4844, which has been revised to ensure more accurate calculations. Additionally, developers reported progress on resolving long-standing bugs affecting client compatibility.\n\n**Development milestones and testing updates** highlighted significant advancements toward implementing Ethereum's next major upgrade (version 2). The team confirmed that testnets for the upcoming Merge will be deployed in early March, with a focus on ensuring seamless integration between execution and consensus layers. Furthermore, developers discussed plans to conduct thorough security audits before deploying the final version.\n\nIn terms of **client implementation progress**, several notable updates were shared during the meeting. Go-ethereum (geth) has made significant strides toward implementing EIP-4844, while other clients like Parity Ethereum are working on integrating new features and bug fixes. The team emphasized the importance of maintaining client compatibility to ensure a smooth transition.\n\n**Action items and upcoming deadlines** included finalizing EIP-4844's implementation details by mid-March and conducting thorough testing before deploying it in April 2023 as part of Shanghai hardfork (version 1.2)."
}