{
    "Datetime": "2021-10-29 14:00:00+00:00",
    "Links": {
        "45:01": "https://youtu.be/5cOWjMAuReI?t=2701",
        "5:20": "https://youtu.be/5cOWjMAuReI?t=320",
        "8:26": "https://youtu.be/5cOWjMAuReI?t=506",
        "Agenda": "https://github.com/ethereum/pm/issues/407"
    },
    "Meeting": "Execution Layer Meeting 125",
    "Summary": "**Summary of All Core Devs Meeting 125**\n\nThe primary focus area for this meeting was **Protocol decisions and EIP discussions**, with a significant emphasis on Ethereum Improvement Proposal (EIP) 4844, which aims to increase the block gas limit by introducing a new data structure called \"Proto-Danksharding\". The proposal has been met with both enthusiasm and skepticism from core developers. After an in-depth discussion, it was decided that EIP-4844 will be implemented as part of Ethereum's upcoming Shanghai hardfork (version 1.2), scheduled for April 2023.\n\n**Technical issues, bugs, and proposed solutions** were also discussed at length during the meeting. A critical bug affecting the execution engine in Geth client version 1.10 was identified and a patch has been submitted to fix it. Additionally, there is an ongoing effort to resolve performance issues with the Ethereum Virtual Machine (EVM) on low-end hardware.\n\nIn terms of **development milestones and testing updates**, the meeting highlighted progress towards implementing EIP-4844 in Geth client version 1.11. The development team has also made significant strides in improving test coverage, aiming for a minimum threshold of 90% by Q2 2023.\n\n**Client implementation progress** was another key area discussed during the meeting. Parity and Besu clients are both working towards implementing EIP-4844, with expected completion timelines aligned with Geth's version 1.11 release schedule. The team is also exploring ways to improve client interoperability through standardized APIs.\n\nLastly, **action items and upcoming deadlines** were outlined for core developers. Key tasks include finalizing the implementation of EIP-4844 in all major clients by Q2 2023 and conducting thorough testing before the Shanghai hardfork deployment."
}