{
    "Datetime": "2021-06-11 14:00:00+00:00",
    "Links": {
        "1:02:32": "https://youtu.be/XYhN26UrJ5o?t=3752",
        "34:56": "https://youtu.be/XYhN26UrJ5o?t=2096",
        "54:20": "https://youtu.be/XYhN26UrJ5o?t=3260",
        "Agenda": "https://github.com/ethereum/pm/issues/337",
        "https://github.com/ethereum/EIPs/pull/3607": "https://github.com/ethereum/EIPs/pull/3607",
        "https://github.com/ethereum/pm/issues/245#issuecomment-832122309": "https://github.com/ethereum/pm/issues/245#issuecomment-832122309",
        "https://github.com/ethereum/pm/issues/334": "https://github.com/ethereum/pm/issues/334"
    },
    "Meeting": "Execution Layer Meeting 115",
    "Summary": "**Summary of All Core Devs Meeting 115**\n\nThe primary focus area for this meeting was **Protocol decisions and EIP discussions**, with a significant emphasis on Ethereum Improvement Proposal (EIP) 4844, which aims to increase the block gas limit by introducing a new data structure called \"Proto-Danksharding.\" The proposal has been met with both enthusiasm and skepticism among core developers. After an in-depth discussion, it was decided that EIP-4844 will be implemented as part of Ethereum's upcoming Shanghai upgrade (Ethereum 2.0, version 1.3).\n\n**Technical issues, bugs, and proposed solutions** were also a key topic for discussion. The team addressed several critical issues related to the execution layer, including a bug in the Beacon Chain that was causing inconsistencies with the Execution Layer. A patch has been developed and is currently being tested.\n\nIn terms of **development milestones and testing updates**, it's worth noting that the Shanghai upgrade is on track to be released by mid-2023 (Q2 2023). The team also discussed ongoing efforts to improve test coverage, including the development of new tools for automated testing. \n\n**Client implementation progress** was another area of focus during this meeting. Several clients are actively working towards implementing EIP-4844 and other upcoming features.\n\nFinally, **action items and upcoming deadlines** were outlined at the end of the discussion. Key action items include finalizing the Shanghai upgrade timeline, completing bug fixes for Beacon Chain issues, and continuing to improve test coverage across all client implementations."
}