{
    "Datetime": "2022-06-10 14:00:00+00:00",
    "Meeting": "Execution Layer Meeting 140",
    "Summary": "**Ethereum Core Devs Meeting 140 Summary**\n\nThe Ethereum core developers' meeting #140 focused primarily on protocol decisions and EIP discussions, with a significant emphasis on EIP-4848 (Base Fee Upgrade). The proposal aims to improve the efficiency of transactions by introducing a new type of transaction that can be processed more quickly. After thorough discussion, it was decided to move forward with implementing this upgrade in Ethereum 2.0's Phase 1.5.\n\nTechnical issues and bugs were also addressed during the meeting. A critical bug affecting the Beacon Chain's attestations processing efficiency was identified and a proposed solution is being implemented for the upcoming release of Gondola (Ethereum 2.0 client version). Additionally, discussions around improving the network's overall performance led to proposals for adjusting parameters such as `MAX_COMMITTEE_SIZE` in future releases.\n\nDevelopment milestones were reviewed with an update on testing progress for Ethereum 2.0 clients. The Lighthouse and Prysm teams reported significant advancements towards achieving full compatibility with Phase 1.5 requirements, while Teku is expected to reach this milestone soon. Notably, the meeting highlighted concerns regarding the delayed release of Gondola due to unforeseen complexities in implementing EIP-4848.\n\nClient implementation progress was also discussed, focusing on resolving outstanding issues and ensuring seamless integration across different clients. Action items were assigned for each team member to address these challenges before the next scheduled update cycle. The upcoming deadlines include a review of client implementations by April 15th and finalizing Gondola's release timeline within the following weeks.\n\nOverall, this meeting demonstrated significant progress towards Ethereum 2.0's development milestones while addressing pressing technical concerns."
}