{
    "Datetime": "2021-09-17 14:00:00+00:00",
    "Meeting": "Execution Layer Meeting 122",
    "Summary": "**Summary of All Core Devs Meeting 122**\n\nThe primary focus area for this meeting was **Protocol decisions and EIP discussions**, where we delved into the proposed changes to the Ethereum protocol through various EIP (Ethereum Improvement Proposal) submissions. Notably, EIP-4848, which aims to improve scalability by introducing a new type of transaction called \"blobs,\" garnered significant discussion. The core devs agreed on several key points regarding its implementation and timeline.\n\nRegarding **Technical issues, bugs, and proposed solutions**, we addressed the ongoing issue with gas pricing incompatibilities between clients. A patch was discussed for the `geth` client to resolve this problem, which is expected to be implemented soon (targeting Ethereum 2.0 release). Additionally, a bug affecting the `parity` client's handling of certain types of transactions was identified and assigned an action item.\n\n**Development milestones and testing updates** were also covered in detail during the meeting. The core devs reviewed progress toward implementing EIP-1559, which introduces a new fee market to improve transaction throughput. Testing for this feature is ongoing with several clients participating (e.g., `geth`, `parity`). A rough estimate of 2 weeks was provided before we can expect significant testing results.\n\n**Client implementation progress**, as expected, varied across different implementations. The meeting highlighted the need for more coordination and collaboration among client developers to ensure a smoother transition toward Ethereum 2.0 release. **Action items and upcoming deadlines** were assigned accordingly; key milestones include resolving gas pricing incompatibilities (targeting within two weeks) and providing EIP-1559 testing results by mid-month.\n\nOverall, the meeting focused on addressing pressing technical issues while pushing forward with critical protocol updates to improve Ethereum's scalability and usability."
}