{
    "Datetime": "2020-02-07 14:00:00+00:00",
    "Meeting": "Execution Layer Meeting 80",
    "Summary": "**Ethereum Core Devs Meeting <MEETING_NUM> Summary**\n\nThe Ethereum core developers' meeting focused primarily on protocol decisions and EIP discussions, with a significant emphasis on **EIP-4848**, which proposes to introduce a new type of transaction called the \"blob\" that can be used for efficient storage. The discussion centered around its implementation details, including gas costs and potential security implications.\n\nRegarding technical issues, several bugs were reported in various clients, particularly in Geth (version 1.10.x) and Parity (version 2.7.x). A proposed solution to address these issues involves updating the `keccak256` function used for hashing. The developers also discussed a fix for a long-standing issue with gas metering.\n\nIn terms of development milestones, the team is working towards implementing **EIP-1559**, which introduces a new fee market and burns excess transaction fees as basefee. This update aims to improve network congestion management and reduce user costs. Testing updates indicate that several clients are making progress in integrating EIP-1559, with Geth targeting version 1.11.x for the implementation.\n\nClient implementation progress was also discussed, particularly regarding **Ethereum 2.0** (Beacon Chain) development. The team is working on finalizing the Beacon Chain's specification and testing its integration with existing clients. Notably, a new milestone has been set to complete this work by Q3 of <YEAR>.\n\nAction items for upcoming deadlines include completing EIP-1559 implementation in Geth and Parity within the next two weeks. Additionally, the team will continue discussing and refining EIP-4848's details before its potential inclusion in future protocol updates.\n\n**Note:** The meeting covered routine updates on client development progress; however, notable changes or concerns were highlighted above."
}