{
    "Datetime": "2020-07-24 14:00:00+00:00",
    "Meeting": "Execution Layer Meeting 92",
    "Summary": "**Summary of All Core Devs Meeting #92**\n\nThe primary focus area for this meeting was **Protocol decisions and EIP discussions**, with a significant emphasis on Ethereum Improvement Proposal (EIP) 4844, which aims to increase the block gas limit by introducing a new data structure called \"proto-danksharding.\" The proposal has been under discussion for several months, and core devs continued debating its implementation details. A key takeaway from this meeting is that EIP-4844 will likely be implemented in Ethereum's upcoming Shanghai hardfork (version 1.2), with an expected release date of April-May.\n\nRegarding **Technical issues, bugs, and proposed solutions**, the team discussed a critical bug affecting some clients' ability to process transactions correctly. A patch has been developed by the Go-ethereum client developers, which is currently being reviewed for inclusion in future releases (version 1.12). Additionally, there was an update on the ongoing effort to resolve issues related to gas pricing and estimation.\n\n**Development milestones and testing updates** highlighted progress toward implementing EIP-4844's proto-danksharding feature. The team has made significant strides in developing a testnet for this new data structure, with plans to deploy it soon (targeting mid-March). This will enable further experimentation and validation of the proposed changes.\n\nIn terms of **Client implementation progress**, Go-ethereum developers reported that they are on track to release version 1.12 by Q2 2023, which includes patches for several critical issues mentioned earlier in this summary. Other clients' development timelines were not discussed extensively during this meeting.\n\n**Action items and upcoming deadlines** include finalizing the EIP-4844 implementation plan, deploying a testnet for proto-danksharding (mid-March), and releasing Go-ethereum version 1.12 by Q2 2023."
}