{
    "Datetime": "2018-05-18 14:00:00+00:00",
    "Meeting": "Execution Layer Meeting 38",
    "Summary": "**Ethereum Core Devs Meeting <MEETING_NUM> Summary**\n\nThe Ethereum core developers' meeting focused primarily on protocol decisions and EIP discussions, with a significant emphasis on **EIP-4848**, which proposes the introduction of a new data structure called \"blobs\" to improve scalability. The discussion centered around addressing concerns regarding gas costs, security implications, and potential interactions with existing protocols.\n\nRegarding technical issues and bugs, several clients reported ongoing struggles with **Beacon Chain synchronization** due to inconsistencies in block propagation times between different nodes. A proposed solution involves implementing a more efficient gossip protocol for Beacon Chain blocks. Additionally, the team discussed an issue affecting some Ethereum 1.x client implementations where incorrect gas limits were being applied.\n\nDevelopment milestones and testing updates highlighted progress on the upcoming **Ethereum 2.0 Merge**, with several clients nearing completion of their implementation requirements. The merge is expected to occur in Q3 <YEAR>, pending successful testing and validation across all participating nodes. Notably, the team reported a significant increase in testnet usage, indicating growing interest from developers.\n\nClient implementation progress showed that **Goerli** (a public Ethereum 2.0 test network) has reached an impressive milestone with over 1 million validators online. This development is crucial for testing and validation of Beacon Chain functionality before its integration into the mainnet.\n\nAction items assigned to team members include finalizing EIP-4848 implementation details, resolving synchronization issues between clients, and ensuring thorough testing prior to the Ethereum 2.0 Merge. The next meeting will focus on reviewing progress made towards these objectives and addressing any emerging concerns or challenges."
}