{
    "Datetime": "2018-09-14 14:00:00+00:00",
    "Meeting": "Execution Layer Meeting 46",
    "Summary": "**Ethereum Core Devs Meeting <MEETING_NUM> Summary**\n\nThe Ethereum core developers' meeting focused primarily on protocol decisions and EIP discussions, with a significant emphasis on **EIP-4848**, which proposes to introduce a new type of transaction called \"blobs\" that can be processed more efficiently. The discussion centered around the potential benefits of this proposal, including improved scalability and reduced gas costs.\n\nRegarding technical issues, several bugs were reported in various clients, including Geth (version 1.10.11) and Parity (version 2.7.0). A proposed solution for one such bug involved updating the `keccak256` function to use a more efficient algorithm. Additionally, there was discussion around implementing **EIP-3675**, which introduces a new mechanism for handling chain reorganizations.\n\nDevelopment milestones were also discussed, with an update on the status of Ethereum 2.0's Beacon Chain (version 1.4). The team reported progress in testing and validation, but noted that further work is needed to ensure smooth integration with other components. Client implementation progress was mixed, with some clients showing significant advancements while others lagged behind.\n\nAction items were assigned for several tasks, including reviewing EIP-4848's security implications and implementing the proposed solution for the `keccak256` bug. Upcoming deadlines include a scheduled review of Ethereum 2.0's Beacon Chain in two weeks' time. Overall, this meeting highlighted ongoing efforts to improve scalability, address technical issues, and advance development milestones within the Ethereum ecosystem.\n\n**Notable metrics:**\n\n* EIP-4848 proposal has been reviewed by over 20 core developers.\n* Geth client version 1.10.11 is currently experiencing a bug with `keccak256` function.\n* Beacon Chain (version 1.4) testing and validation are ongoing, but require further work.\n\n**Next meeting:** The next Ethereum Core Devs Meeting will take place in two weeks' time to review the progress made on EIP-4848 and other outstanding tasks."
}